# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [5]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [6]:
url="https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv"
baby_names=pd.read_csv(url)

### Step 4. See the first 10 entries

In [7]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [8]:
baby_names=baby_names.drop("Unnamed: 0", axis=1)
baby_names=baby_names.drop("Id", axis=1)

### Step 6. Is there more male or female names in the dataset?

In [17]:
males=(baby_names["Gender"] == "M").sum()
females=(baby_names["Gender"] == "F").sum()

if males >= females:
    print ("There's more males")

else: 
     print ("There's more females")
        
print(males)

There's more females
457549

### Step 7. Group the dataset by name and assign to names

In [39]:
names=baby_names.groupby('Name').sum()
names.head()

           Year  Count
Name
Aaban      4027     12
Aadan      8039     23
Aadarsh    2009      5
Aaden    393963   3426
Aadhav     2014      6

### Step 8. How many different names exist in the dataset?

In [38]:
len(names)

17632

### Step 9. What is the name with most occurrences?

In [40]:
names.Count.idxmax()

'Jacob'

### Step 10. How many different names have the least occurrences?

In [41]:
len(names[names.Count == names.Count.min()])

2578

### Step 11. What is the median name occurrence?

In [42]:
len(names[names.Count == names.Count.max()])

1

### Step 12. What is the standard deviation of names?

In [44]:
names.Count.std()

11006.069467890569

### Step 13. Get a summary with the mean, min, max, std and quartiles.